[
  {
    "id": 1,
    "image": "/portfolio_2/assets/csm_mockup.png",
    "name": "Community Sicence Museum",
    "type": "Semester Project 1",
    "description": [
      "This project showcases my first-semester competencies in project management, communication technology, HTML/CSS development, and design principles. I developed an engaging, user-friendly, and responsive website for the fictional Community Science Museum, primarily targeting students aged 7-15 and families with young children.",
      " Without relying on any frameworks, the website was meticulously built using HTML and CSS and thoroughly tested to ensure compliance with WCAG guidelines and SEO best practices. The site's design intends to educate and excite visitors, compelling them to visit the museum in person."
    ],
    "github": "https://github.com/May-Tove/semester-project-1",
    "demo": "https://sience-museum.netlify.app/"
  },
  {
    "id": 2,
    "image": "/portfolio_2//assets/rainydays_mockup.png",
    "name": "Rainydays",
    "type": "Cross Course Project",
    "description": [
      "Over my first year, I developed an online storefront for Rainydays, a fictitious outdoor clothing brand, as part of multiple courses. Utilizing HTML, CSS, and JavaScript, and employing a headless WordPress CMS for product data, I handled everything from target audience analysis to responsive website development. ",

      "This project involved creating wireframes, high-fidelity prototypes, conducting contextual inquiries, and integrating key features such as product listing, cart functionality, checkout page, and a contact page with form validation. It served as a comprehensive platform to demonstrate my proficiency in HTML, CSS, JavaScript, user testing, and the WordPress REST API."
    ],
    "github": "https://github.com/May-Tove/cross-course-project",
    "demo": "https://rainydays-mt.netlify.app/"
  },
  {
    "id": 3,
    "image": "/portfolio_2//assets/globetrotter_mockup.png",
    "name": "Globetrotter",
    "type": "Project Exam 1",
    "description": [
      "My final first-year project at Noroff was a self-themed blog site, reflecting my comprehensive understanding of web development. Developed with HTML, CSS, and JavaScript, and employing a headless WordPress CMS for blog posts, the site features a homepage, about page, blog post list, individual blog post pages, and a contact page.",
      "JavaScript-built features like a carousel, image modal, contact form validation, blog post search, and category filtering enhanced user interaction. This project fortified my skills in user testing, iterative development based on user feedback, and proficiency in HTML, CSS, JavaScript, and WordPress REST API."
    ],
    "github": "https://github.com/May-Tove/project-exam-1",
    "demo": "https://globetrotter-travel-blog.netlify.app/"
  },
  {
    "id": 4,
    "image": "/portfolio_2//assets/social_mockup.png",
    "name": "Social",
    "type": "Cross Course Project 2nd Year",
    "description": [
      "In my third semester at Noroff, I developed Social, an interactive platform for Noroff students and teachers. Utilizing Noroff's API, I majorly worked with Bootstrap, SCSS, and Vanilla JavaScript, enhancing my grasp of JavaScript, modular code structure, and DRY principles. The homepage featured a feed of posts, search bar, and new post creation, while the profile page displayed user details, followers, user posts, and a post creation form. The login page incorporated HTML validated forms.",
      "Extended functionality included user authentication, post view, feed filtering and search, individual post view, and post creation, update, and deletion. This project amplified my proficiency in SCSS, Bootstrap, JavaScript, and API integration."
    ],
    "github": "https://github.com/May-Tove/social-media-project",
    "demo": "https://social-cross-course.netlify.app/"
  },
  {
    "id": 5,
    "image": "/portfolio_2//assets/bidspot_4.png",
    "name": "BidSpot",
    "type": "Semester Project 2",
    "description": [
      "An online auction platform showcasing the expertise acquired over the first three semesters at Noroff. Built with Bootstrap, SCSS, Vanilla JavaScript, and the Noroff Auction API, it highlights modular JavaScript usage, DRY principles for tidy, manageable code, and Bootstrap and SCSS application for a responsive, appealing interface.",
      "Using knowledge from my Workflow course, the project incorporates Prettier for code formatting, ESLint for linting, and Husky for managing Git hooks. BidSpot enables user authentication, listing creation, and bidding, alongside seamless browsing for non-registered users. In essence, BidSpot combines advanced front-end technologies with superior web development methods to deliver an engaging online auction platform."
    ],
    "github": "https://github.com/May-Tove/bidspot",
    "demo": "https://bidspot.netlify.app/"
  },
  {
    "id": 6,
    "image": "/portfolio_2/assets/smartcart_mockup.png",
    "name": "SmartCart",
    "type": "Course assignment Javascript Frameworks",
    "description": [
      "A project for my JavaScript Frameworks course at Noroff, SmartCart is an eCommerce web application built with React. Simulating a real-world online shopping experience, it features product display, detailed product pages, cart management, checkout process, and a contact form.",
      "Zustand is used for cart state management, and Styled Components for responsive design, ensuring a flawless user experience across different devices. Libraries like React Icons and React Toastify are used to enhance the application aesthetics with icons and user notifications. Product data is fetched from the Noroff API."
    ],
    "github": "https://github.com/May-Tove/smartcart",
    "demo": "https://smartcart-js-frameworks.netlify.app/"
  },
  {
    "id": 7,
    "image": "/portfolio_2//assets/holidaze_mockup.png",
    "name": "Holidaze",
    "type": "Project Exam 2",
    "description": [
      "My final exam project at Noroff, is a comprehensive application developed with React, showcasing all skills acquired throughout my degree. Catering to Customers looking for accommodation and venue managers needing a platform to manage their venues and bookings. It is built with Vite, React, Tailwind CSS, JavaScript, HTML, CSS, and the Noroff Holidaze API.",
      "Adobe XD and GitHub Projects aided in project management, while Prettier, ESLint, and Husky maintained code quality. Reliability was ensured via user testing, unit tests with Jest, and end-to-end testing with Cypress, including automated workflows for testing and deployment. Key features include user authentication, venue view and search, booking, and venue management."
    ],
    "github": "https://github.com/May-Tove/holidaze",
    "demo": "https://may-tove.github.io/holidaze/"
  }
]
